Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: See xref:doc-concept.adoc[Quarkus documentation content types] for more information about content types and organization.
ja_jp: コンテンツの種類と構成の詳細は、xref:doc-concept.adoc[Quarkusドキュメントのコンテンツの種類] を参照してください。

source: See xref:gc-logging[Native Memory Management GC Logging section] for details.
ja_jp: 詳細は、 xref:gc-logging[ネイティブメモリ管理GCロギングセクション] を参照してください。

source: See xref:hibernate-orm.adoc#flyway[the Hibernate ORM guide] for more details.
ja_jp: 詳細は xref:hibernate-orm.adoc#flyway[Hibernate ORM ガイド] を参照してください。

source: See xref:keycloak-dev-mode[Running the Application in Dev mode] section above about testing your application in a dev mode.
ja_jp: devモードでのアプリケーションのテストについては、上記の xref:keycloak-dev-mode[開発モードでアプリケーションを実行] のセクションを参照してください。

source: See xref:keycloak-dev-mode[Running the Application in Dev mode] section above about testing your application in dev mode.
ja_jp: devモードでのアプリケーションのテストについては、上記の xref:keycloak-dev-mode[Devモードでのアプリケーションの実行] セクションを参照してください。

source: See xref:mongodb-dev-services.adoc[MongoDB Dev Services].
ja_jp: xref:mongodb-dev-services.adoc[MongoDB Dev Services] を参照してください。

source: See xref:parameter-mapping[Parameter mapping] for more advanced use-cases.
ja_jp: より高度な使用例については、 xref:parameter-mapping[パラメータ・マッピング] を参照してください。

source: See xref:redis-dev-services.adoc[Redis Dev Service].
ja_jp: link:redis-dev-services[Redis Dev Service] を参照してください。

source: See xref:security-authorization.adoc[Security Authorization] for more information about Role Based Access Control and other authorization options.
ja_jp: 役割ベースのアクセス制御およびその他の認可オプションの詳細については、 link:security-authorization[セキュリティー認可]を参照してください。

source: See xref:security-built-in-authentication.adoc#proactive-authentication[Proactive Authentication] for more information.
ja_jp: 詳細については、 link:security-built-in-authentication#proactive-authentication[プロアクティブ認証]を参照してください。

source: See xref:security-customization.adoc[Security Customization] for more information about customizing Quarkus Security and other useful tips about the reactive security, registering the security providers, etc.
ja_jp: Quarkus Securityのカスタマイズの詳細や、リアクティブセキュリティー、セキュリティープロバイダーの登録などに関する便利なヒントについては、xref:security-customization.adoc[Security Customization] を参照してください。

source: See xref:security-jpa.adoc[JPA IdentityProvider] and xref:security-jdbc.adoc[JDBC IdentityProvider] for more information. You can also use xref:security-testing.adoc#configuring-user-information[User Properties IdentityProvider] for testing.
ja_jp: 詳細は、xref:security-jpa.adoc[JPA IdentityProvider] および xref:security-jdbc.adoc[JDBC IdentityProvider] を参照してください。テストには、xref:security-testing.adoc#configuring-user-information[User Properties IdentityProvider] を使用することもできます。

source: See xref:security-jwt-build.adoc#sign-claims[signing claims guide] for mode details.
ja_jp: 詳細については、xref:security-jwt-build.adoc#sign-claims[クレーム署名ガイド] を参照してください。

source: See xref:security-jwt-build.adoc[Generate JWT tokens with SmallRye JWT] and learn how to generate the encrypted or inner-signed and then encrypted tokens fast.
ja_jp: xref:security-jwt-build.adoc[SmallRye JWT を使用した JWT トークンの生成] を参照し、暗号化または内部署名されてから暗号化されたトークンをすぐに生成する方法を確認してください。

source: See xref:security-jwt-build.adoc[Generate JWT tokens with SmallRye JWT] and learn how to generate the encrypted or inner-signed and then encrypted tokens quickly.
ja_jp: xref:security-jwt-build.adoc[SmallRye JWT を使用した JWT トークンの生成] を参照して、暗号化されたトークンまたは内部署名されたトークンをすばやく生成して暗号化する方法を学習します。

source: See xref:security-oidc-bearer-token-authentication.adoc#bearer-token-integration-testing-security-annotation[OpenID Connect Bearer Token Integration testing], xref:security-oidc-code-flow-authentication.adoc#code-flow-integration-testing-security-annotation[OpenID Connect Authorization Code Flow Integration testing] and xref:security-jwt.adoc#integration-testing-security-annotation[SmallRye JWT Integration testing] for more details about testing the endpoint code which depends on the injected `JsonWebToken`.
ja_jp: 注入された `JsonWebToken` に依存するエンドポイントコードのテストの詳細は、xref:security-oidc-bearer-token-authentication.adoc#bearer-token-integration-testing-security-annotation[OpenID Connect ベアラートークン結合テスト], xref:security-oidc-code-flow-authentication.adoc#code-flow-integration-testing-security-annotation[OpenID Connect 認可コードフロー結合テスト] and xref:security-jwt.adoc#integration-testing-security-annotation[SmallRye JWT 結合テスト] を参照してください。

source: See xref:security-oidc-bearer-token-authentication.adoc#integration-testing-security-annotation[OpenID Connect Bearer Token Integration testing], xref:security-oidc-code-flow-authentication.adoc#integration-testing-security-annotation[OpenID Connect Authorization Code Flow Integration testing] and xref:security-jwt.adoc#integration-testing-security-annotation[SmallRye JWT Integration testing] for more details about testing the endpoint code which depends on the injected `JsonWebToken`.
ja_jp: 注入された `JsonWebToken` に依存するエンドポイントコードのテストの詳細については、 xref:security-oidc-bearer-token-authentication.adoc#integration-testing-security-annotation[OpenID Connect ベアラートークン結合テスト] 、 xref:security-oidc-code-flow-authentication.adoc#integration-testing-security-annotation[OpenID Connect 認可コードフロー結合テスト] 、 xref:security-jwt.adoc#integration-testing-security-annotation[SmallRye JWT 統合テスト] を参照してください。

source: See xref:security-oidc-code-flow-authentication.adoc#authentication-completion-action[OIDC Authentication Completion Action] for more information.
ja_jp: 詳細は xref:security-oidc-code-flow-authentication.adoc#authentication-completion-action[OIDC 認証完了アクション] を参照してください。

source: See xref:security-openid-connect-multitenancy.adoc[Using OpenID Connect Multi-Tenancy] for more information about multiple tenants which can support `Bearer` or `Authorization Code Flow` authentication mechanism and configured statically or dynamically.
ja_jp: `Bearer` または `Authorization Code Flow` 認証メカニズムをサポートし、静的または動的に設定できる複数のテナントの詳細については、xref:security-openid-connect-multitenancy.adoc[Using OpenID Connect Multi-Tenancy] を参照してください。

source: See xref:security-openid-connect-providers.adoc[OpenID Connect providers] for more details about configuring other well-known providers.
ja_jp: その他のよく知られたプロバイダーの設定については、 xref:security-openid-connect-providers.adoc[OpenID Connectのプロバイダー] を参照してください。

source: See xref:security-openid-connect-providers.adoc[Well Known OpenID Connect providers] for more details about configuring other well-known providers.
ja_jp: 他の既知のプロバイダーの設定の詳細については、xref:security-openid-connect-providers.adoc[よく知られた OpenID Connect プロバイダーの設定] を参照してください。

source: See xref:security-openid-connect.adoc#integration-testing-security-annotation[OpenID Connect Bearer Token Integration testing], xref:security-openid-connect-web-authentication.adoc#integration-testing-security-annotation[OpenID Connect Authorization Code Flow Integration testing] and xref:security-jwt.adoc#integration-testing-security-annotation[SmallRye JWT Integration testing] for more details about testing the endpoint code which depends on the injected `JsonWebToken`.
ja_jp: 注入された `JsonWebToken` に依存するエンドポイント・コードのテストの詳細については、 link:security-openid-connect.html#integration-testing-security-annotation[OpenID Connect Bearer Token Integration testing]、 link:security-openid-connect-web-authentication.html#integration-testing-security-annotation[OpenID Connect Authorization Code Flow Integration testing]、 link:security-jwt.html#integration-testing-security-annotation[SmallRye JWT Integration testing]を参照してください。

source: See xref:security-testing.adoc[Security Testing] for more information about testing Quarkus Security.
ja_jp: Quarkus Securityのテストの詳細については、 link:security-testing[セキュリティーのテスト]を参照してください。

source: See xref:smallrye-jwt-build.adoc[Generate JWT tokens with SmallRye JWT] and learn how to generate the encrypted or inner-signed and then encrypted tokens fast.
ja_jp: xref:smallrye-jwt-build.adoc[Generate JWT tokens with SmallRye JWT を使用した JWT トークンの生成] を参照し、暗号化または内部署名されてから暗号化されたトークンを迅速に生成する方法を確認してください。

source: See xref:tip-quarkus-native-remote-container-build[Creating a Linux executable without GraalVM installed] for more details.
ja_jp: 詳しくは、GraalVMが xref:tip-quarkus-native-remote-container-build[GraalVMをインストールせずにLinux実行可能ファイルを作成] をご覧ください。

source: See xref:uri-parameters[URI parameters] for more information about URI mapping.
ja_jp: URIマッピングの詳細については、 xref:uri-parameters[URIパラメータ] を参照してください。

source: See xref:{doc-guides}/doc-concept.adoc[Quarkus documentation content types] for more information about content types and organization.
ja_jp: コンテンツの種類と構成の詳細については、 link:{doc-guides}/doc-concept.html[Quarkusドキュメントのコンテンツの種類] を参照してください。

source: See xref:{doc-guides}/doc-concepts.adoc[Quarkus documentation concepts] for more information about content types and organization.
ja_jp: コンテンツの種類と設定の詳細については、 xref:{doc-guides}/doc-concepts.adoc[Quarkus ドキュメントのコンセプト] を参照してください。

source: See you Monday 17th January at https://quarkus.io/insights/ !
ja_jp: 1月17日（月）に https://quarkus.io/insights/ でお会いしましょう !

source: See you Monday 25. July at https://quarkus.io/insights/ !
ja_jp: 7月25日（月）https://quarkus.io/insights/ でお会いしましょう。

source: See you all Monday!
ja_jp: 月曜日にお会いましょう!

source: Select Bearer token authentication mechanism
ja_jp: ベアラートークン認証メカニズムの選択

source: Select Quarkus as the event type that lane will display and press OK.
ja_jp: そのレーンに表示されるイベントタイプとして Quarkus を選択し、OK を押します。

source: Select `External` to authorise any Google user to log in to your application and press `CREATE`:
ja_jp: `External` を選択して、Google ユーザーがアプリケーションにログインすることを許可し、 `CREATE` を押します。

source: Select `File -> Open Project`
ja_jp: `File → Open Project` を選択

source: Select `Import project from external model` and `Gradle`
ja_jp: `Import project from external model` を選択して `Gradle`

source: Select `Import project from external model` and `Maven`
ja_jp: `Import project from external model` および `Maven` を選択します。

source: Select `Service IDs` and press `Continue`:
ja_jp: `Service IDs` を選択し、 `Continue` を押します。

source: Select `Web App` as application type, then fill in your application details (use `<host>/_renarde/security/twitter-success` for the `Callback URI`).
ja_jp: アプリケーションタイプとして `Web App` を選択し、アプリケーションの詳細を入力します (`Callback URI` の場合は `<host>/_renarde/security/twitter-success` を使用)。

source: Select `Web application` as `Application type`, and add `http://localhost:8080/_renarde/security/oidc-success` in the `Authorised redirect URIs` list, then press `CREATE`:
ja_jp: `Application type` として `Web application` を選択し、 `Authorised redirect URIs` リストに `http://localhost:8080/_renarde/security/oidc-success` を追加して、 `CREATE` を押します。

source: Select `Web application` as `Application type`, and add `http://localhost:8080/google` in the `Authorised redirect URIs` list, then press `CREATE`:
ja_jp: `Application type` として `Web application` を選択し、 `Authorised redirect URIs` リストに http://localhost:8080/google を追加して、 `CREATE` を押します。

source: Select a datasource for the persistence unit.
ja_jp: 永続化ユニットのデータソースを選択します。

source: Select a realm, enter a client ID and secret, user name and password, a relative service endpoint path, and click *Test service*. It returns a status code, such as `200`, `403`, `401`, or `404`. If the username is also set in the `quarkus.keycloak.devservices.users` map property containing usernames and passwords, then you do not have to set a password when testing the service. Be aware that you do not have to initialize `quarkus.keycloak.devservices.users` to test the service by using the `password` grant.
ja_jp: レルムを選択し、クライアント ID とシークレット、ユーザー名とパスワード、相対サービスエンドポイントパスを入力して、*Test service* をクリックします。 `200`、`403`、`401`、`404` などのステータスコードが返されます。 ユーザー名とパスワードを含む `quarkus.keycloak.devservices.users` マッププロパティーにもユーザー名が設定されている場合は、サービスをテストするときにパスワードを設定する必要はありません。 `password` グラントを使用してサービスをテストするために、`quarkus.keycloak.devservices.users` を初期化する必要はないことに注意してください。

source: Select a realm, enter client id and secret, username amd user password, a relative service endpoint path, click on `Test Service` and you will see a status code such as `200`, `403`, `401` or `404` printed. If the username is also set in `quarkus.keycloak.devservices.users` map property containing usernames and passwords then you do not have to set a password when testing the service. But note, you do not have to initialize `quarkus.keycloak.devservices.users` to test the service using the password grant.
ja_jp: レルムを選択し、クライアントIDとシークレット、ユーザー名とユーザーパスワード、サービスのエンドポイントの相対パスを入力し、 `Test Service` をクリックすると、 `200 `, `403 `, `401` または `404` のようなステータスコードが表示されます。ユーザー名とパスワードを含む `quarkus.keycloak.devservices.users` マッププロパティにユーザー名も設定されている場合は、サービスをテストする際にパスワードを設定する必要はありません。ただし、パスワードグラントを使用してサービスをテストするために、 `quarkus.keycloak.devservices.users` を初期化する必要はないことに注意してください。

source: Select a realm, enter the client ID and secret, a relative service endpoint path, and click *Test service*. It returns a status code, such as `200`, `403`, `401`, or `404`.
ja_jp: レルムを選択し、クライアント ID とシークレット、相対サービスエンドポイントパスを入力して、*Test service* をクリックします。 `200`、`403`、`401`、`404` などのステータスコードが返されます。

source: Select a realm, enter the client id and secret, a relative service endpoint path, click on `Test Service` and you will see a status code such as `200`, `403`, `401` or `404` printed.
ja_jp: レルムを選択し、クライアントIDとシークレット、相対サービスエンドポイントパスを入力し、 `Test Service` をクリックすると、 `200 `, `403 `, `401` または `404` のようなステータスコードが出力されます。

source: Select application name, workspace, and remember it, you will need it later:
ja_jp: アプリケーション名とワークスペースを選択し、後で必要になるので覚えておいてください。

source: Select the **Keycloak Admin** link from the **OpenID Connect** card in the Dev UI.
ja_jp: Dev UI の **OpenID Connect** カードから **Keycloak Admin** リンクを選択します。

source: Select the `Quarkus` configuration type:
ja_jp: `Quarkus` 構成タイプを選択します。

source: Select the plus button to add a new lane on the left side, then check to display that lane.
ja_jp: プラスボタンを選択して左側に新しいレーンを追加し、そのレーンを表示するにはそのボックスにチェックマークを入れます。

source: Select the project root
ja_jp: プロジェクトのルートを選択します。

source: Select the registered application:
ja_jp: 登録されているアプリケーションを選択します：

source: Select the target architecture. You can select more than one to build multi-archs images.
ja_jp: ターゲットアーキテクチャーを選択します。複数選択して multi-archs イメージを構築できます。

source: Select your Primary App ID and press `Save`:
ja_jp: Primary App ID を選択し、 `Save` を押します。

source: Selected Filters
ja_jp: 選択されたフィルター

source: Selecting Tests to Run
ja_jp: 実行するテストの選択

source: Selecting a gRPC server
ja_jp: gRPC サーバーの選択

source: Selecting among multiple extensions
ja_jp: 複数のエクステンションから選択する

source: Selecting gRPC clients
ja_jp: gRPC クライアントの選択

source: Semantic convention differences
ja_jp: 意味上の慣習の違い

source: Semantic conventions
ja_jp: セマンティック規約

source: Semantic line breaks
ja_jp: セマンティック改行

source: Semi-automatic service binding
ja_jp: 半自動のサービスバインディング

source: Send Micrometer metrics through OpenTelemetry
ja_jp: OpenTelemetry を介した Micrometer メトリクスの送信

source: Send a `GET` request multiple times from another terminal:
ja_jp: 別のターミナルから `GET` リクエストを複数回送信してみましょう。

source: Send a `GET` request to the Wikipedia API
ja_jp: Wikipedia API に `GET` リクエストを送信します。

source: Send a message to the address `greeting`. Message payload is `name`
ja_jp: アドレス `greeting` に、ペイロード `name` を持つメッセージを送信します。

source: Send and receive messages
ja_jp: メッセージの送受信

source: Send back the current counter value
ja_jp: 現在のカウンターの値の返却

source: Send emails
ja_jp: メールを送信

source: Send logs to Fluentd (EFK)
ja_jp: Fluentd(EFK)へのログ送信

source: Send logs to Fluentd with the Syslog handler
ja_jp: Syslog ハンドラーを使用した Fluentd へのログの送信

source: Send logs to Graylog
ja_jp: ログをGraylogに送信

source: Send logs to Logstash / the Elastic Stack (ELK)
ja_jp: Logstash / Elastic Stack (ELK)にログを送信

source: Send logs to the Elastic Stack (ELK) in the ECS (Elastic Common Schema) format with the Socket handler
ja_jp: ソケットハンドラーを使用して ECS (Elastic Common Schema) 形式で Elastic Stack (ELK) にログを送信する

source: Send logs with OpenTelemetry Logging
ja_jp: OpenTelemetry Loggingを使用したログの送信

source: Send logs with the `logging-gelf` extension
ja_jp: `logging-gelf` エクステンションを使用したログの送信

source: Send messages
ja_jp: メッセージの送信

source: Send metadata to GraalVM for example classes in need of reflection
ja_jp: メタデータをGraalVMに送信。例えば、リフレクションに必要なクラス

source: Send some movies to the application:
ja_jp: いくつかの映画をアプリに送信します:

source: Send the entity to Kafka inside the Kafka transaction.
ja_jp: Kafka トランザクション内で Kafka にエンティティを送信します。

source: Send the managed instance to Kafka. Make sure we wait for the message to complete before closing the transaction.
ja_jp: マネージドインスタンスを Kafka に送信します。メッセージが完了するのを待ってから、トランザクションを閉じるようにします。

source: Send the message to Kafka, the `send` method returns a `CompletionStage`
ja_jp: メッセージをKafkaに送信し、 `send` メソッドは `CompletionStage` を返却します。

source: Send the payload to Kafka inside the Kafka transaction.
ja_jp: Kafka トランザクション内でペイロードを Kafka に送信します。

source: Sender-constraining access tokens
ja_jp: 送信者制限アクセストークン

source: Sending AMQP messages
ja_jp: AMQP メッセージの送信

source: Sending Cloud Events
ja_jp: クラウドイベントの送信

source: Sending Cloud Events on Kafka
ja_jp: クラウドイベントをKafkaで送信する

source: Sending Emails using SMTP
ja_jp: SMTPでのメールの送信

source: Sending HTML emails with inlined attachments
ja_jp: 添付ファイルがインライン化されたHTMLメールの送信

source: Sending Multipart messages
ja_jp: マルチパートメッセージの送信

source: Sending RabbitMQ messages
ja_jp: RabbitMQ メッセージの送信

source: Sending a payload returns a `CompletionStage`, completed when the message is acked. If the message transmission fails, the `CompletionStage` is completed exceptionally with the reason of the nack.
ja_jp: ペイロードを送信すると、メッセージが ack されたときに完了する `CompletionStage` が返されます。メッセージの送信が失敗した場合、nack の理由を伴って例外扱いで `CompletionStage` が完了します。

source: Sending and Receiving Cloud Events with Kafka
ja_jp: クラウドイベントをKafkaで送受信

source: Sending and publishing messages use the Vert.x event bus:
ja_jp: メッセージの送信と公開にはVert.x Event busを使用します。

source: Sending attachments
ja_jp: 添付ファイルの送信

source: Sending emails using SMTP
ja_jp: SMTPでのメールの送信

source: Sending emails via multiple SMTP servers is supported in Quarkus 3.0.
ja_jp: Quarkus 3.0では、複数のSMTPサーバーを経由した電子メールの送信がサポートされています。

source: Sending emails via several SMTP servers is supported in Quarkus 3.0.0.CR1.
ja_jp: Quarkus 3.0.0.CR1では、複数のSMTPサーバーを経由した電子メールの送信がサポートされています。

source: Sending key/value pairs
ja_jp: キー/値のペアの送信

source: Sending large payloads
ja_jp: 大きなペイロードの送信

source: Sending messages
ja_jp: メッセージの送信

source: Sending messages to Kafka
ja_jp: Kafka へのメッセージの送信

source: Sending messages to Pulsar
ja_jp: Pulsar へのメッセージの送信

source: Sending messages with @Emitter
ja_jp: @Emitter を使ったメッセージの送信

source: Sending messages with Emitter
ja_jp: Emitter を使ったメッセージの送信

source: Sending ping messages
ja_jp: ping メッセージの送信

source: Sending pong messages
ja_jp: pong メッセージの送信

source: Sending quote request
ja_jp: 見積もり依頼の送信

source: Sends a ping message from all connected client instances to their remote servers every 10 seconds.
ja_jp: 接続されているすべてのクライアントインスタンスからリモートサーバーに 10 秒ごとに ping メッセージを送信します。

source: Sends a ping message from the server to each connected client every 2 seconds.
ja_jp: サーバーから接続された各クライアントに 2 秒ごとに ping メッセージを送信します。

source: Sensitive request and response header values can be masked using `quarkus.rest-client.logging.masked-headers`. The value of any configured headers will be replaced with `****` in the logs.
ja_jp: 機密性の高いリクエストおよびレスポンスのヘッダー値は、 `quarkus.rest-client.logging.masked-headers` を使用してマスクできます。設定されたヘッダーの値は、ログ内で `****` に置き換えられます。

source: Sensitive request and response header values can be masked using `quarkus.rest-client.logging.masked-headers`. The value of any configured headers will be replaced with `<hidden>` in the logs.
ja_jp: 機密性の高いリクエストおよびレスポンスヘッダーの値は、 `quarkus.rest-client.logging.masked-headers` を使用してマスクできます。設定されたヘッダーの値は、ログで `<hidden>` に置き換えられます。

source: Sentence length
ja_jp: センテンスの長さ

source: Sentinel (when working with Redis in High Availability mode).
ja_jp: Sentinel (高可用性モードで Redis を使用する場合)。

source: Sentinel Mode
ja_jp: Sentinel モード

source: Separate each word with a dash character.
ja_jp: 各単語をダッシュ文字で区切ります。

source: Separate server mode (gRPC Java/Netty-based)
ja_jp: 独立サーバーモード (gRPC Java/Netty ベース)

source: Separating Java and native image compilation
ja_jp: Java とネイティブイメージのコンパイルの分離

source: Separating Query parameter values
ja_jp: クエリーパラメーター値の分離

source: Separating the execution of your Unit Tests and Integration Tests
ja_jp: ユニットテストと統合テストの実行を分離する

source: Separator for splitting a string which may contain multiple group values. It will only be used if the `smallrye.jwt.path.groups` property points to a custom claim whose value is a string. The default value is a single space because a standard OAuth2 `scope` claim may contain a space separated sequence.
ja_jp: 複数のグループ値を含む可能性のある文字列を分割するためのセパレーター。これは、 `smallrye.jwt.path.groups` プロパティーが値が文字列のカスタムクレームを指している場合にのみ使用されます。標準の OAuth2 `scope` クレームにはスペースで区切られたシーケンスが含まれている可能性があるため、デフォルト値はスペース 1 個です。

source: Separator for splitting a string which might contain multiple group values. It is only used if the `smallrye.jwt.path.groups` property points to a custom claim with a string value. The default value is a single space because a standard OAuth2 `scope` claim might contain a space-separated sequence.
ja_jp: 複数のグループ値を含む可能性のある文字列を分割するためのセパレーター。これは、 `smallrye.jwt.path.groups` プロパティーが値が文字列のカスタムクレームを指している場合にのみ使用されます。標準の OAuth2 `scope` クレームにはスペースで区切られたシーケンスが含まれている可能性があるため、デフォルト値はスペース 1 個です。

source: Sequential composition
ja_jp: シーケンシャル合成

source: Sequential composition allows chaining dependent asynchronous operations. This is achieved using `onItem().transformToUni(item -> ...)`. Unlike `transform`, the function passed to `transformToUni` returns a Uni.
ja_jp: シーケンシャル合成では、依存性のある非同期操作を連鎖させることができます。これは `onItem().transformToUni(item → …​)` を使って実現しています。 `transform` とは異なり、 `transformToUni` に渡される関数は Uni を返します。

source: Serial GC
ja_jp: シリアルGC

source: Serial GC, the default option in GraalVM and Quarkus, is a single-threaded non-concurrent GC, just like HotSpot’s Serial GC. The implementation in GraalVM however is different from the HotSpot one, and there can be significant differences in the runtime behavior.
ja_jp: GraalVMとQuarkusのデフォルトオプションであるシリアルGCは、HotSpotのシリアルGCと同様にシングルスレッドで非同期のGCです。しかし、GraalVMの実装はHotSpotのものと異なっており、実行時の動作に大きな違いがある場合があります。

source: Serialization
ja_jp: シリアル化

source: Serialization (Key Value types support)
ja_jp: シリアライゼーション（Key Value型のサポート）

source: Serialization and Deserialization
ja_jp: シリアライズとデシリアライズ

source: Serialization and Pulsar Schema
ja_jp: シリアライゼーションと Pulsar Schema

source: Serialization and deserialization
ja_jp: シリアライズとデシリアライズ

source: Serialization of user types uses a library based on protobuf, called https://github.com/infinispan/protostream[Protostream].
ja_jp: ユーザ型のシリアライズは、 https://github.com/infinispan/protostream[Protostream]と呼ばれるprotobufをベースにしたライブラリを使用します。

source: Serialized String payload with `content_type` set to `application/json`
ja_jp: `content_type` が `application/json` に設定されたシリアライズされた文字列ペイロード

source: Serializer/deserializer autodetection
ja_jp: シリアライザー/デシリアライザーの自動検出

source: Serializing and Deserializing data
ja_jp: データのシリアライズとデシリアライズ

source: Serializing via JSON-B
ja_jp: JSON-B を介したシリアライズ

source: Serializing via Jackson
ja_jp: Jackson を介したシリアライズ

source: Server
ja_jp: サーバー

source: Server API
ja_jp: サーバー API

source: Server Configuration
ja_jp: サーバー構成

source: Server Interceptors
ja_jp: サーバーインターセプター
